fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	ДлительнаяОперация = ВыполнитьДлительнуюОперацию();	
			//СоздатьАктыНаСервере();
	Оповещение = Новый ОписаниеОповещения("ФункцияВыполнена", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьДлительнуюОперацию()
//АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);

ДатаНачала = Объект.Период.ДатаНачала;
ДатаОкончания = Объект.Период.ДатаОкончания;
ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
	                    "ВКМ_РеализацияАгентскихДоговоровВызовСервера.ВКМ_СозданиеАбонентскихОтгрузок", ДатаНачала, ДатаОкончания);
//ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
//	                    "ВКМ_РеализацияАгентскихДоговоровВызовСервера.ВКМ_СозданиеАбонентскихОтгрузок", ДатаНачала, ДатаОкончания, АдресХранилища);	                   
Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ФункцияВыполнена(Результат, ДополнительныеПараметры) Экспорт
		Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выполнено");
ДанныеДокумента = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);				
//ДанныеДокумента = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
УдалитьИзВременногоХранилища(Результат.АдресРезультата);
Таблица = Объект.ТабличнаяЧасть;
Таблица.Очистить();
Для Каждого Строка Из ДанныеДокумента Цикл
НоваяСтрока = Таблица.Добавить();
НоваяСтрока.Договор = Строка.Договор;
НоваяСтрока.Реализация = Строка.Реализация;	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
